Alinamgz/ucode_IoT_reaction/i2copt3001_CC1352R1_LAUNCHXL_tirtos_ccs/i2copt3001.syscfg
/*
 * Copyright (c) 2019-2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
// @cliArgs --board /ti/boards/CC1352R1_LAUNCHXL

/*
 *  i2copt3001.syscfg
 */
 
/* ======== Board ======== */
var board = system.deviceData.board.name;

/* ======== Sensors BoosterPack ======== */
if (board.match(/MSP.EXP432E/)) {
    var Sensors = scripting.addHardware("/ti/boards/boosterpacks/BOOSTXL-BASSENSORS", "boosterpack2");
	var Sensors1 = scripting.addHardware("/ti/boards/boosterpacks/BOOSTXL-SENSORS", "boosterpack2");
}
else {
    var Sensors = scripting.addHardware("/ti/boards/boosterpacks/BOOSTXL-BASSENSORS");
	var Sensors1 = scripting.addHardware("/ti/boards/boosterpacks/BOOSTXL-SENSORS");
}

/* ======== RTOS ======== */
var RTOS = scripting.addModule("/ti/drivers/RTOS");
RTOS.name = "TI-RTOS";

/* ======== Display ======== */
var Display = scripting.addModule("/ti/display/Display");
var displayUART = Display.addInstance();
displayUART.$hardware = system.deviceData.board.components.XDS110UART;

/* ======== I2C ======== */
var I2C = scripting.addModule("/ti/drivers/I2C");
var i2c = I2C.addInstance();
i2c.$name = "CONFIG_I2C_OPT";
i2c.$hardware = Sensors.components.OPT3001.subComponents.I2C;

/* ======== GPIO ======== */
var GPIO = scripting.addModule("/ti/drivers/GPIO");
var gpio1 = GPIO.addInstance();
gpio1.$hardware = system.deviceData.board.components.LED0;
gpio1.$name = "CONFIG_LED_0_GPIO";

var gpio2 = GPIO.addInstance();
gpio2.$name = "CONFIG_GPIO_OPT3001_INT";
gpio2.$hardware = Sensors.components.OPT3001.subComponents.INTERRUPT;
gpio2.pull = "Pull Up";
gpio2.interruptTrigger = "Falling Edge";

var gpio3 = GPIO.addInstance();
gpio3.$name = "CONFIG_GPIO_OPT3001_PWR";
gpio3.$hardware = Sensors.components.OPT3001.subComponents.POWER;